ThirdParty-v1912/swak4Foam-latest/Examples/manipulateFvSolutionFvSchemes/pitzDailyTimeSwitched/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs (
    "libsimpleFunctionObjects.so"
);

functions
{
    switchSolverSettings
    {
        type timeDependentFvSolutionFvSchemes;
        outputControlMode timeStep;
        outputInterval 1;
        solutionTriggers (
            //            (10 PCGSolver)
            (200 higherRelax)
        );
        schemesTriggers (
            // (0 linearDiv)
            (100 reset)
            //(300 linearDiv)
        );
        resetBeforeTrigger true;
    }
}

// ************************************************************************* //
